[{"title":"The Cybersecurity Information Sharing Act Faces Expiration","content":"The CISA is set to expire on September 30, 2025, raising urgent questions about risk, politics, and the future of threat intelligence.\nThe post The Cybersecurity Information Sharing Act Faces Expiration appeared first on SecurityWeek.","link":"https://www.securityweek.com/the-cybersecurity-information-sharing-act-faces-expiration/","date":"2025-09-30T00:52:17.000Z","category":"General Security News"},{"title":"The State of AI in the SOC 2025 - Insights from Recent Study ","content":"Security leaders are embracing AI for triage, detection engineering, and threat hunting as alert volumes and burnout hit breaking points.\nA comprehensive survey of 282 security leaders at companies across industries reveals a stark reality facing modern Security Operations Centers: alert volumes have reached unsustainable levels, forcing teams to leave critical threats uninvestigated. You can","link":"https://thehackernews.com/2025/09/the-state-of-ai-in-soc-2025-insights.html","date":"2025-09-29T11:30:00.000Z","category":"General Security News"},{"title":"Dutch Teens Arrested for Allegedly Helping Russian Hackers","content":"One of the two 17-year-old boys allegedly walked by law enforcement and embassy offices carrying a Wi-Fi sniffer.\nThe post Dutch Teens Arrested for Allegedly Helping Russian Hackers appeared first on SecurityWeek.","link":"https://www.securityweek.com/dutch-teens-arrested-for-allegedly-helping-russian-hackers/","date":"2025-09-29T09:58:09.000Z","category":"Policy & Legal"},{"title":"Crash Tests for Security: Why BAS Is Proof of Defense, Not Assumptions","content":"Car makers don’t trust blueprints. They smash prototypes into walls. Again and again. In controlled conditions.\nBecause design specs don’t prove survival. Crash tests do. They separate theory from reality. Cybersecurity is no different. Dashboards overflow with “critical” exposure alerts. Compliance reports tick every box. \nBut none of that proves what matters most to a CISO:\n\nThe","link":"https://thehackernews.com/2025/09/crash-tests-for-security-why-bas-is.html","date":"2025-09-26T11:22:00.000Z","category":"Policy & Legal"},{"title":"British Department Store Harrods Warns Customers That Some Personal Details Taken in Data Breach","content":"Four people were arrested in July on suspicion of their involvement in cyberattacks against Harrods and two other leading British retail chains, Marks & Spencer and the Co-op and Harrods.\nThe post British Department Store Harrods Warns Customers That Some Personal Details Taken in Data Breach appeared first on SecurityWeek.","link":"https://www.securityweek.com/british-department-store-harrods-warns-customers-that-some-personal-details-taken-in-data-breach/","date":"2025-09-28T18:07:52.000Z","category":"Data Breaches"},{"title":"ShadowLeak Zero-Click Flaw Leaks Gmail Data via OpenAI ChatGPT Deep Research Agent","content":"Cybersecurity researchers have disclosed a zero-click flaw in OpenAI ChatGPT's Deep Research agent that could allow an attacker to leak sensitive Gmail inbox data with a single crafted email without any user action.\nThe new class of attack has been codenamed ShadowLeak by Radware. Following responsible disclosure on June 18, 2025, the issue was addressed by OpenAI in early August.\n\"The attack","link":"https://thehackernews.com/2025/09/shadowleak-zero-click-flaw-leaks-gmail.html","date":"2025-09-20T05:31:00.000Z","category":"Data Breaches"},{"title":"EvilAI Malware Masquerades as AI Tools to Infiltrate Global Organizations","content":"Threat actors have been observed using seemingly legitimate artificial intelligence (AI) tools and software to sneakily slip malware for future attacks on organizations worldwide.\nAccording to Trend Micro, the campaign is using productivity or AI-enhanced tools to deliver malware targeting various regions, including Europe, the Americas, and the Asia, Middle East, and Africa (AMEA) region.","link":"https://thehackernews.com/2025/09/evilai-malware-masquerades-as-ai-tools.html","date":"2025-09-29T16:36:00.000Z","category":"Malware"},{"title":"China-Linked PlugX and Bookworm Malware Attacks Target Asian Telecom and ASEAN Networks","content":"Telecommunications and manufacturing sectors in Central and South Asian countries have emerged as the target of an ongoing campaign distributing a new variant of a known malware called PlugX (aka Korplug or SOGU).\n\"The new variant's features overlap with both the RainyDay and Turian backdoors, including abuse of the same legitimate applications for DLL side-loading, the","link":"https://thehackernews.com/2025/09/china-linked-plugx-and-bookworm-malware.html","date":"2025-09-27T12:06:00.000Z","category":"Malware"},{"title":"CISA Sounds Alarm on Critical Sudo Flaw Actively Exploited in Linux and Unix Systems","content":"The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Monday added a critical security flaw impacting the Sudo command-line utility for Linux and Unix-like operating systems to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation in the wild.\nThe vulnerability in question is CVE-2025-32463 (CVSS score: 9.3), which affects Sudo versions prior to","link":"https://thehackernews.com/2025/09/cisa-sounds-alarm-on-critical-sudo-flaw.html","date":"2025-09-30T05:41:00.000Z","category":"Vulnerabilities"},{"title":"Build secure network architectures for generative AI applications using AWS services","content":"As generative AI becomes foundational across industries—powering everything from conversational agents to real-time media synthesis—it simultaneously creates new opportunities for bad actors to exploit. The complex architectures behind generative AI applications expose a large surface area including public-facing APIs, inference services, custom web applications, and integrations with cloud infrastructure. These systems are not immune to […]","link":"https://aws.amazon.com/blogs/security/build-secure-network-architectures-for-generative-ai-applications-using-aws-services/","date":"2025-09-29T19:11:48.000Z","category":"Vulnerabilities"}]