[{"title":"CometJacking: One Click Can Turn Perplexity’s Comet AI Browser Into a Data Thief","content":"Cybersecurity researchers have disclosed details of a new attack called CometJacking targeting Perplexity's agentic AI browser Comet by embedding malicious prompts within a seemingly innocuous link to siphon sensitive data, including from connected services, like email and calendar.\nThe sneaky prompt injection attack plays out in the form of a malicious link that, when clicked, triggers the","link":"https://thehackernews.com/2025/10/cometjacking-one-click-can-turn.html","date":"2025-10-04T14:37:00.000Z","category":"General Security News"},{"title":"Scanning Activity on Palo Alto Networks Portals Jump 500% in One Day","content":"Threat intelligence firm GreyNoise disclosed on Friday that it has observed a massive spike in scanning activity targeting Palo Alto Networks login portals.\nThe company said it observed a nearly 500% increase in IP addresses scanning Palo Alto Networks login portals on October 3, 2025, the highest level recorded in the last three months. It described the traffic as targeted and structured, and","link":"https://thehackernews.com/2025/10/scanning-activity-on-palo-alto-networks.html","date":"2025-10-04T10:39:00.000Z","category":"General Security News"},{"title":"Oneleet Raises $33 Million for Security Compliance Platform","content":"The cybersecurity startup will expand its engineering team, add more AI capabilities, and invest in go-to-market efforts.\nThe post Oneleet Raises $33 Million for Security Compliance Platform appeared first on SecurityWeek.","link":"https://www.securityweek.com/oneleet-raises-33-million-for-security-compliance-platform/","date":"2025-10-03T12:48:36.000Z","category":"Policy & Legal"},{"title":"Red Hat OpenShift AI Flaw Exposes Hybrid Cloud Infrastructure to Full Takeover","content":"A severe security flaw has been disclosed in the Red Hat OpenShift AI service that could allow attackers to escalate privileges and take control of the complete infrastructure under certain conditions.\nOpenShift AI is a platform for managing the lifecycle of predictive and generative artificial intelligence (GenAI) models at scale and across hybrid cloud environments. It also facilitates data","link":"https://thehackernews.com/2025/10/critical-red-hat-openshift-ai-flaw.html","date":"2025-10-01T12:36:00.000Z","category":"Policy & Legal"},{"title":"In Other News: PQC Adoption, New Android Spyware, FEMA Data Breach","content":"Other noteworthy stories that might have slipped under the radar: cybercriminals offer money to BBC journalist, LinkedIn user data will train AI, Tile tracker vulnerabilities.\nThe post In Other News: PQC Adoption, New Android Spyware, FEMA Data Breach appeared first on SecurityWeek.","link":"https://www.securityweek.com/in-other-news-pqc-adoption-new-android-spyware-fema-data-breach/","date":"2025-10-03T13:56:19.000Z","category":"Data Breaches"},{"title":"2025 Cybersecurity Reality Check: Breaches Hidden, Attack Surfaces Growing, and AI Misperceptions Rising","content":"Bitdefender’s 2025 Cybersecurity Assessment Report paints a sobering picture of today’s cyber defense landscape: mounting pressure to remain silent after breaches, a gap between leadership and frontline teams, and a growing urgency to shrink the enterprise attack surface.\nThe annual research combines insights from over 1,200 IT and security professionals across six countries, along with an","link":"https://thehackernews.com/2025/10/2025-cybersecurity-reality-check.html","date":"2025-10-01T11:07:00.000Z","category":"Data Breaches"},{"title":"Beer Giant Asahi Says Data Stolen in Ransomware Attack","content":"The brewing giant has reverted to manual order processing and shipment as operations at its Japanese subsidiaries are disrupted.\nThe post Beer Giant Asahi Says Data Stolen in Ransomware Attack appeared first on SecurityWeek.","link":"https://www.securityweek.com/beer-giant-asahi-says-data-stolen-in-ransomware-attack/","date":"2025-10-06T07:58:49.000Z","category":"Malware"},{"title":"Detour Dog Caught Running DNS-Powered Malware Factory for Strela Stealer","content":"A threat actor named Detour Dog has been outed as powering campaigns distributing an information stealer known as Strela Stealer.\nThat's according to findings from Infoblox, which found the threat actor to maintain control of domains hosting the first stage of the stealer, a backdoor called StarFish.\nThe DNS threat intelligence firm said it has been tracking Detour Dog since August 2023, when","link":"https://thehackernews.com/2025/10/detour-dog-caught-running-dns-powered.html","date":"2025-10-03T18:11:00.000Z","category":"Malware"},{"title":"Oracle E-Business Suite Zero-Day Exploited in Cl0p Attacks","content":"Oracle has informed customers that it has patched a critical remote code execution vulnerability tracked as CVE-2025-61882.\nThe post Oracle E-Business Suite Zero-Day Exploited in Cl0p Attacks appeared first on SecurityWeek.","link":"https://www.securityweek.com/oracle-e-business-suite-zero-day-exploited-in-cl0p-attacks/","date":"2025-10-06T07:43:51.000Z","category":"Vulnerabilities"},{"title":"Zimbra Zero-Day Exploited to Target Brazilian Military via Malicious ICS Files","content":"A now patched security vulnerability in Zimbra Collaboration was exploited as a zero-day earlier this year in cyber attacks targeting the Brazilian military.\nTracked as CVE-2025-27915 (CVSS score: 5.4), the vulnerability is a stored cross-site scripting (XSS) vulnerability in the Classic Web Client that arises as a result of insufficient sanitization of HTML content in ICS calendar files,","link":"https://thehackernews.com/2025/10/zimbra-zero-day-exploited-to-target.html","date":"2025-10-06T06:01:00.000Z","category":"Vulnerabilities"}]